src/cf/Catalogs/ВидыПодарочныхСертификатов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>ВидыПодарочныхСертификатов</Name>
			<Comment>Добавил Шаравин Евгений 18.05.2025 по проектной работе курса "Архитектор 1С" (УЦ ОТУС)</Comment>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>НоминальнаяСтоимость</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДенежнаяСуммаНеотрицательная</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СрокДействия</Name>
					<Comment>Срок действия сертификата с момента реализации (в месяцах)</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Возвратный</Name>
					<Comment>Допускает возврат сертификатов данного вида</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МногократноеИспользование</Name>
					<Comment>Допускается многократное использование сертификатов данного вида</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ШаблонНомера</Name>
					<Comment>Шаблон номеров сертификатов данного вида</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Действует</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/cf/InformationRegisters/ИсторияСтатусовПодарочныхСертификатов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>ИсторияСтатусовПодарочныхСертификатов</Name>
			<Comment>Добавил Шаравин Евгений 18.05.2025 по проектной работе курса "Архитектор 1С" (УЦ ОТУС)</Comment>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыПодарочныхСертификатов</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДействуетДо</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ПодарочныйСертификат</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодарочныеСертификаты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/Enums/СтатусыПодарочныхСертификатов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>СтатусыПодарочныхСертификатов</Name>
			<Comment>Добавил Шаравин Евгений 18.05.2025 по проектной работе курса "Архитектор 1С" (УЦ ОТУС)</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Активирован</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЧастичноИспользован</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПолностьюИспользован</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Возвращен</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НеИспользован</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cf/Catalogs/ВидыПодарочныхСертификатов/Forms/ФормаСписка/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ШагНоминальнойСтоимости = Константы.ШагНоминальнойСтоимостиПодарочныхСертификатов.Получить();
	КонтролироватьШагНоминальнойСтоимости = ЗначениеЗаполнено(ШагНоминальнойСтоимости);
	Элементы.ШагНоминальнойСтоимости.Видимость = КонтролироватьШагНоминальнойСтоимости;
КонецПроцедуры

&НаКлиенте
Процедура КонтролироватьШагНоминальнойСтоимостиПриИзменении(Элемент)
	Элементы.ШагНоминальнойСтоимости.Видимость = КонтролироватьШагНоминальнойСтоимости;
	
	Если НЕ КонтролироватьШагНоминальнойСтоимости Тогда
		ШагНоминальнойСтоимости = 0;
		УстановитьШагНоминальнойСтоимости(ШагНоминальнойСтоимости);
	КонецЕсли;
КонецПроцедуры

&НаСервереБезКонтекста
Процедура УстановитьШагНоминальнойСтоимости(ШагНоминальнойСтоимости)
	Если ШагНоминальнойСтоимости > 0 Тогда
		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ
			|	ИсторияСтатусовПодарочныхСертификатовСрезПоследних.ПодарочныйСертификат.Владелец КАК ВидПодарочногоСертификата,
			|	ИсторияСтатусовПодарочныхСертификатовСрезПоследних.ПодарочныйСертификат.Владелец.НоминальнаяСтоимость КАК НоминальнаяСтоимость,
			|	ИсторияСтатусовПодарочныхСертификатовСрезПоследних.ПодарочныйСертификат.Владелец.Валюта КАК Валюта
			|ИЗ
			|	РегистрСведений.ИсторияСтатусовПодарочныхСертификатов.СрезПоследних КАК ИсторияСтатусовПодарочныхСертификатовСрезПоследних
			|ГДЕ
			|	ИсторияСтатусовПодарочныхСертификатовСрезПоследних.Статус В (ЗНАЧЕНИЕ(Перечисление.СтатусыПодарочныхСертификатов.Активирован), ЗНАЧЕНИЕ(Перечисление.СтатусыПодарочныхСертификатов.ЧастичноИспользован))";
		
		РезультатЗапроса = Запрос.Выполнить();              
		
		Если НЕ РезультатЗапроса.Пустой() Тогда		
			ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
			
			Если ВыборкаДетальныеЗаписи.Количество() = 1 Тогда
				ТекстСообщения = СтрШаблон(НСтр("ru = 'Обнаружен вид действующих подарочных сертификатов, номинальная сумма которых не соответствует указанному шагу:%1'"), Символы.ПС);
			Иначе
				ТекстСообщения = СтрШаблон(НСтр("ru = 'Обнаружены виды действующих подарочных сертификатов, номинальная сумма которых не соответствует указанному шагу:%1'"), Символы.ПС);
			КонецЕсли;
			
			ЕстьНекратныеНоминалы = Ложь;
			
			Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
				Если ВыборкаДетальныеЗаписи.НоминальнаяСтоимость % ШагНоминальнойСтоимости <> 0 Тогда
					ТекстСообщения = ТекстСообщения + СтрШаблон("%1 %2 %3 %4", Символы.ПС, ВыборкаДетальныеЗаписи.ВидПодарочногоСертификата, ВыборкаДетальныеЗаписи.НоминальнаяСтоимость, ВыборкаДетальныеЗаписи.Валюта);
					ЕстьНекратныеНоминалы = Истина;
				КонецЕсли;
			КонецЦикла;
			
			Если ЕстьНекратныеНоминалы Тогда
				ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
                ШагНоминальнойСтоимости = Константы.ШагНоминальнойСтоимостиПодарочныхСертификатов.Получить();
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	Константы.ШагНоминальнойСтоимостиПодарочныхСертификатов.Установить(ШагНоминальнойСтоимости);
КонецПроцедуры

&НаКлиенте
Процедура ШагНоминальнойСтоимостиПриИзменении(Элемент)
	УстановитьШагНоминальнойСтоимости(ШагНоминальнойСтоимости);
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	Если КонтролироватьШагНоминальнойСтоимости И НЕ ЗначениеЗаполнено(ШагНоминальнойСтоимости) Тогда
		СтандартнаяОбработка = Ложь;
		ОбщегоНазначенияКлиент.СообщитьПользователю(НСтр("ru = 'Поле ""Шаг номинальной стоимости"" не заполнено.'"), , "ШагНоминальнойСтоимости", , Отказ);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура СписокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	Если КонтролироватьШагНоминальнойСтоимости Тогда
		СтандартнаяОбработка = ПроверитьЗаполнение();
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьДоступностьКомандыСгенерироватьПодарочныеСертификаты()
	ТекущиеДанные = Элементы.Список.ТекущиеДанные;
	
	Если ТекущиеДанные <> Неопределено Тогда
		Элементы.ФормаОбработкаГенерацияПодарочныхСертификатовСгенерироватьПодарочныеСертификаты.Доступность = ТекущиеДанные.Действует;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура СписокПриАктивизацииСтроки(Элемент)
	ОбновитьДоступностьКомандыСгенерироватьПодарочныеСертификаты();
КонецПроцедуры

&НаКлиенте
Процедура СписокПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	Если КонтролироватьШагНоминальнойСтоимости Тогда
		Отказ = НЕ ПроверитьЗаполнение();
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	Если ИмяСобытия = "ВидПодарочныхСертификатов_Запись" Тогда
		Элементы.Список.Обновить();
		ОбновитьДоступностьКомандыСгенерироватьПодарочныеСертификаты();
	КонецЕсли;
КонецПроцедуры
